MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mkv46f256vlh16.s
    .weak      ADCB_IRQHandler
    .thumb_set ADCB_IRQHandler,Default_Handler

    .weak      Reserved90_IRQHandler
    .thumb_set Reserved90_IRQHandler,Default_Handler

    .weak      CAN0_ORed_Message_buffer_IRQHandler
    .thumb_set CAN0_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN0_Bus_Off_IRQHandler
    .thumb_set CAN0_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN0_Error_IRQHandler
    .thumb_set CAN0_Error_IRQHandler,Default_Handler

    .weak      CAN0_Tx_Warning_IRQHandler
    .thumb_set CAN0_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Rx_Warning_IRQHandler
    .thumb_set CAN0_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Wake_Up_IRQHandler
    .thumb_set CAN0_Wake_Up_IRQHandler,Default_Handler

    .weak      PWMA_CMP0_IRQHandler
    .thumb_set PWMA_CMP0_IRQHandler,Default_Handler

    .weak      PWMA_RELOAD0_IRQHandler
    .thumb_set PWMA_RELOAD0_IRQHandler,Default_Handler

    .weak      PWMA_CMP1_IRQHandler
    .thumb_set PWMA_CMP1_IRQHandler,Default_Handler

    .weak      PWMA_RELOAD1_IRQHandler
    .thumb_set PWMA_RELOAD1_IRQHandler,Default_Handler

    .weak      PWMA_CMP2_IRQHandler
    .thumb_set PWMA_CMP2_IRQHandler,Default_Handler

    .weak      PWMA_RELOAD2_IRQHandler
    .thumb_set PWMA_RELOAD2_IRQHandler,Default_Handler

    .weak      PWMA_CMP3_IRQHandler
    .thumb_set PWMA_CMP3_IRQHandler,Default_Handler

    .weak      PWMA_RELOAD3_IRQHandler
    .thumb_set PWMA_RELOAD3_IRQHandler,Default_Handler

    .weak      PWMA_CAP_IRQHandler
    .thumb_set PWMA_CAP_IRQHandler,Default_Handler

    .weak      PWMA_RERR_IRQHandler
    .thumb_set PWMA_RERR_IRQHandler,Default_Handler

    .weak      PWMA_FAULT_IRQHandler
    .thumb_set PWMA_FAULT_IRQHandler,Default_Handler

    .weak      CMP3_IRQHandler
    .thumb_set CMP3_IRQHandler,Default_Handler

    .weak      Reserved109_IRQHandler
    .thumb_set Reserved109_IRQHandler,Default_Handler

    .weak      CAN1_ORed_Message_buffer_IRQHandler
    .thumb_set CAN1_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN1_Bus_Off_IRQHandler
    .thumb_set CAN1_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN1_Error_IRQHandler
    .thumb_set CAN1_Error_IRQHandler,Default_Handler

    .weak      CAN1_Tx_Warning_IRQHandler
    .thumb_set CAN1_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Rx_Warning_IRQHandler
    .thumb_set CAN1_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Wake_Up_IRQHandler
    .thumb_set CAN1_Wake_Up_IRQHandler,Default_Handler
